{
    "messages": [{
        "welcome":
            "Welcome to Picnic Quest!\nI'm Junimo the cat, and it's so good that you're here!\nYou are now Marni, the adorable german shepard. You are all bark, and no bite, easily scared, but fierce when it comes to defending your crew! We live in a well-loved, one-story house in the suburbs with two humans who are off at their day jobs. As usual, you took this opportunity to take a nice long mid-day nap. I left you a letter, please read it when you wake up!\nEnter a name and select \"New\" to begin a new game, or choose a saved game and select \"Load\" to continue!\n",
        "intro":
            "You slowly awaken in a warm, cozy living room. Sunlight pours through the curtains, lighting up the familiar sofa in the center of the room. There are no signs of humans around here, just the soft sound of the trees rustling in the breeze outside. You stretch your paws and arch your back, slowly waking up from a relaxing nap. You suddenly realize that a letter has been placed on the pillow in front of you. In the corner of the room, you can hear the TV quietly buzzing as a show plays on the screen.\n\nTo the North you can see the door to the basement. To the East you can see the closed door to the bedroom. To the South you can see the front door that leads to the porch outside. To the West you see the doorway to the kitchen.\n",
        "help":
            "Try these commands:\nLook: Repeat the description of the current room\nLook at: Learn more about a nearby item or feature.\nGo/Move: Using cardinal directions or room names, move your character from room to room.\nTake: Pick up an item and put it in your inventory.\nDrop: Drop an item where you are.\nUse: Use an item in your inventory.\nListen: Listen to an object or feature.\nWear: Put on a piece of clothing or an item.\nInventory: Look at all of your items in your inventory.\nsavegame: Save the current game state.\nloadgame: Load your previously saved game.\nOther verbs: Eat, Read, Nap, Scratch, Invite, Talk, Listen.\n",
        "inventory":
            "This is your inventory:",
        "living room.long":
            "You are in a warm, cozy living room. Sunlight pours through the curtains, lighting up familiar sofa in the center of the room. There are no signs of humans around here, just the soft sound of the trees rustling in the breeze outside. You stretch your paws and arch your back, slowly waking up from a relaxing nap. You suddenly realize that a letter has been placed on the pillow in front of you. In the corner of the room, you can hear the TV quietly buzzing as a show plays on the screen. There is a flashlight sticking out from the corner of the sofa.\n\nTo the North you can see the creaky wooden stairs to the basement.\nTo the East you can see the door to the bedroom.\nTo the South you can see the front door that leads to the porch outside.\nTo the West you see the doorway to the kitchen.\n",
        "living room.short":
            "You are in the comfy living room in the center of the house. A large comfy sofa sits in the center of the room. There is a flashlight sticking out from the corner of the sofa. A quietly buzzing TV sits on a stand at the far corner of the room.\n\nTo the North you can see the creaky wooden stairs to the basement.\nTo the East you can see the closed door to the bedroom.\nTo the South you can see the front door that leads to the porch outside.\nTo the West you see the doorway to the kitchen.\n",
        "basement.block":
            "It's much too dark to see down there. It wouldn't be safe for you to go down to the basement without a light of some kind. Maybe there's something nearby that you can use to light up the stairs.\n",
        "basement.long":
            "You make your way down the creaky wooden stairs into the cold basement. Cobwebs line the handrail as you decend into the dimly lit room. The humans clearly don't come down here very often. You can see a friendly mouse peering out from under the stairs, and an old familiar suitcase lying in a corner against the wall.Beneath the stairs you can smell the distinct scent of ripe, delicious violet mushrooms. These would be an excellent snack for your friends at the picnic!\n\nThe only way out of the basement is South which takes you back to the Living Room.\n",
        "basement.short":
            "The cold, dark basement is eerily quiet. Only a small amount of light peeks in from the doorway upstairs. You can see a friendly mouse peering out from under the stairs, and an old familiar suitcase lying in a corner against the wall. Beneath the stairway a patch of ripe, tasty mushrooms are growing.\n\nThe only way out of the basement is South back to the living room.\n",
        "kitchen.long":
            "You stand in the brightly lit kitchen. The white tile floor glistens brightly, and rumbling sound of the humming refrigerator fills the room. The humans must have been clumsy earlier, because a thick wooden spoon has rolled under a chair in the center of the room. Nearby you can see a few ants gathered suspiciously together. On the sleek marble countertops, you can see the corner of a plastic container of scrumptious, freshly picked blueberries! These would be perfect for a picnic!\n\nTo the North you can see the pantry.\nTo the East you can see the living room.\n",
        "kitchen.short":
            "You find yourself in the brightly lit kitchen. The shiny refrigerator is on one end of the room, and a line of ants is crawling along the tiled floor. You can see a wooden spoon that has rolled under the table, and a carton of blueberries at the edge of the counter.\n\nTo the North you can see the pantry.\nTo the East you can see the doorway to the living room.\n",
        "pantry.long":
            "You stand in the well-stocked pantry, looking at shelves packed floor to ceiling with human food. Luckily, there is a bin full of yummy dog treats situated on the bottom shelf in front of you. The handle is really heavy, and won't open easily. You will need something strong to pop it open in order to stock up on the tasty snacks. There are some strong smelling cleaning supplies to the back of the pantry.\n\nTo the South you can see the kitchen.\n",
        "pantry.short":
            "You stand in the well-stocked pantry, looking at shelves packed floor to ceiling with human food. There is a sturdy bin full of dog treats on the bottom shelf in front of you. There are some strong smelling cleaning supplies to the back of the pantry.\n\nTo the South you can see the kitchen.\n",
        "bedroom.block":
            "The door is jammed tight. Maybe there's something pushing it closed from the other side? You could probably force your way through, but you'll need something to protect your head first. Maybe there's something lying around that can help.\n",
        "bedroom.long" :
            "You stand in the human's bedroom, at the foot of their mattress. A sunbeam cuts through the window, highlighting a tempting napping spot in the balled up, fuzzy green blanket on the human's bed. You can hear the sound of wind blowing from just outside.\n\nTo the North you can see the open doorway to the bathroom.\nTo the West you can see the living room.\n",
        "bedroom.short":
            "You are in the bedroom. The fuzzy green blanket on the bed looks like the perfect location to take a nice long mid-day nap. The window is cracked slightly, and you can see outside.\n\nTo the North you can see the open doorway to the bathroom.\nTo the West you can see the living room.\n",
        "bathroom.long":
            "You stand in the well-maintained bathroom. Blue and green tiles line the floor, and you can smell citrus-scented cleaners that the humans used this morning. The drip-drip-drip sound of the sink echoes in the small room. On the side of the bathtub you can see a bar of fresh, unscented soap. Hanging on a nearby rack is a red-and-white checkered towel, which would look amazing for the picnic!\n\nTo the South you can see the bedroom.\n",
        "bathroom.short":
            "You stand in the clean bathroom. The crowded sink is visible, and you can see a bar of soap on the side of the bathtub. There is a checkered towel hanging on a rack, which would be perfect for the picnic!\n\nTo the South you can see the bedroom.\n",
        "porch.long":
            "You are standing on the front porch, looking out to the area in front of you. The fresh air feels good on your furry face as you take in the sights around you. Your favorite rocking chair is next to you on the porch, with a light grey shawl draped over the back. You can see a big dirt pile at the bottom of the porch. \n\nTo the West you can see the alley.\nTo the East you can see the park where your friends are waiting for you.\nTo the North you can use the front door to go to the living room.\nOn the South side of the porch is a gutter that you can climb to the roof.\n",
        "porch.short":
            "You are standing on the front porch, looking out to the lawn in front of you. Your favorite rocking chair is next to you, and a large dirt pile is down at the end of the steps.\n\nTo the West you can see the alley.\nTo the East you can see the park where your friends are waiting for you.\nTo the North you can use the Front Door to go to the living room.\nOn the South side of the porch is a gutter that you can climb to the roof.\n",
        "alley.long":
            "You are standing in the dimly lit alley behind the house. The power lines hang above your head, and your paws plod along the cold pavement. You find yourself next to the trashcan, and find a football helmet lying on its side. There's a guitar sitting on the ground, with most of the strings still intact. Behind the recycling bin, you can see a small raccoon, covered in dirt. The raccoon seems be bothered by his dirt covered coat. Maybe he could use something to help clean up?\n\nTo the East you can see the porch\n",
        "alley.short":
            "yourself next to the trashcan, and find a football helmet lying on its side. There's an old guitar sitting on the ground. Behind the recycling bin, you can see a small raccoon, covered in dirt. The raccoon seems be bothered by his filthy coat. Maybe he could use something to help clean up?\n\nTo the East you can see the porch\n",
        "roof.long":
            "You find yourself standing on the roof of your one-story house. You can see a pair of squirrels chasing each other in the nearby branches. A small flock of hungry looking birds circles overhead. You can see out to view the whole neighborhood from here.\n\nTo the North you can climb the gutter back to the porch.\n",
        "roof.short":
            "You find yourself standing on the roof of your one-story house. A family of birds circles overhead. You can see out to view the whole neighborhood from here.\n\nTo the North you can climb the gutter back to the porch.\n",
        "park.long":
            "You finally made it to Henderson Park, and you can see that everyone is already here waiting for you. There is a table where all of the party supplies are set up. Once you're ready you can join all of the invited animal friends that gathered together under a huge tree by typing \"look at friends\".\n",
        "park.short":
            "You finally made it to Henderson Park, and you can see that everyone is already here waiting for you. There is a table where all of the party supplies are set up. Once you're ready, you can join all of the invited animal friends that gathered together under a huge tree by typing \"look at friends\".\n",
    
        "blueberries":
            "These blueberries were freshly picked yesterday from the Johnson Family Blueberry Orchard. These will make an amazing addition to the picnic!\n",
        "mushrooms":
            "These fresh mushrooms must have been growing in the dark cool basement for months. Theyare almost as large as your head! They will taste amazing at a picnic.\n",
        "dog treats":
            "Groovy Snacks Dog Treats are some of your absolute favorites. These ones are chicken & bacon flavored. They're the perfect crunchy, savory treat for a sunny picnic.\n",
        "towel":
            "This light blue towel is freshly washed, and smells like lemon and lavender. It's the same color as the clear blue sky outside, and would work well as a picnic blanket for today.\n",
        "umbrella":
            "This simple yellow umbrella looks like a rubber duck when it's opened. It's cute and lightweight, but will easily keep the sun off of you at a picnic.\n",
        "letter":
            "This letter is written in the familiar handwriting of your best friend, Junimo. It reads \n\"Good morning Marni! I hope you had a great nap! The day is beautiful outside, and I've decided to throw a picnic! You are cordially invited to join us at Henderson Park this afternoon. Everybody is asked to bring three different snacks, a picnic blanket, and an umbrella. (If you're unable to find everything, that's OK too!)\nYour friend,\nJunimo the cat\n",
        "wooden spoon":
            "This sturdy wooden spoon is rarely used by the humans here. It looks really strong though, and could probably be useful for propping something open.\n",
        "football helmet":
            "This old, beaten up football helmet is much too small for the humans in the house to wear anymore. It could pretty easily fit on your head though! It would be really helpful to use this to push open a stuck door.\n",
        "soap":
            "This bar of handsoap has a bright scent of orange citrus. This would be really useful to clean up an animal after a day of playing in dirt.\n",
        "flashlight":
            "This old clunky flashlight still works,despite not having been used in many months. The batteries are still in good condition, and the light is bright enough to illuminate any dark spaces around the house.\n",
    
        "sofa":
            "This sofa is well worn, and covered in a nice floral pattern. There is a sunbeam cutting through the room that is keeping the sofa nice and warm. The gap beneath the sofa is a great hiding spot, with all sorts of lost tools and items that tend to roll underneath.\n",
        "tv":
            "There is a tv on in the corner of the room. Right now it's showing a nature documentary about lions in sub-Saharan Africa, narrated by David Attenborough.\n",
        "mouse":
            "There is a friendly mouse that lives in the basement, currently scampering around in circles at the foot of the stairs. It looks up at you with a curious tilt of the head, and wrinkles up its nose at you. This mouse is clearly not afraid of bigger animals like yourself.\n",
        "suitcase":
            "There is a well worn leather suitcase sitting at the far end of the basement. This case has been all over the globe. The wheels are worn down and the handle has nearly fallen apart.\n",
        "refrigerator":
            "The refrigerator is mostly stocked with bottled sodas, sports drinks, and leftover pizza slices. This isn't exactly what you had in mind for picnic snacks. Maybe the pantry will have something tastier.\n",
        "ants":
            "There is a long  line of ants leading from outside to a little stain of spilled ketchup on the floor. These humans can be really messy sometimes!\n",
        "shelves":
            "Boxes of Poptarts and other processed food sit on the middle shelves, but these are no good for animals to eat. There are plenty of dried food in tricky jars and tupperware that would be impossible to get into without thumbs.\n",
        "cleaning supplies":
            "At the back of the pantry you can see some lemony scented cleaning supplies. This sure keeps the house clean, but wow it smells so strong!\n",
        "blanket":
            "This green blanket has been around nearly as long as you have! It smells safe and familiar.\n",
        "window":
            "You peek out of the window and can hear the sound of trees rustling and birds chirping outside.\n",
        "sink":
            "The sink is full of toiletries, toothbrushes, razors, and other things that aren't necessarily good for animals.\n",
        "bathtub":
            "The humans really adore this clawfoot bathtub. The white porcelain looks so polished, you can practically see your reflection!\n",
        "rocking chair":
            "This is the human's favorite rocking chair. It has a strong wooden frame and a well worn but comfy blue cushion. There's a warm wool sweater draped over the back for any chilly evenings.\n",
        "dirt pile":
            "The humans have big plans to set up a garden this autumn. This big pile of dirt has been sitting in front of their front porch for a few weeks, while they get ready to shovel it into planters nearby. It'll be a great source of fresh veggies once they're done!\n",
        "raccoon":
            "This friendly neighborhood raccoon peers out from behind a recycling bin. He appears to be caked in mud, but remains cheerful nonetheless. The raccoon keeps one arm clenched tightly around a bright yellow umbrella, that would be perfect for your picnic. Maybe you can make a trade?\n",
        "guitar":
            "Somebody must have left this old, beaten up guitar back in the alley way many weeks ago. It's been exposed to the elements for quite a while, but still has most of its strings intact.\n",
        "birds":
            "The nest at the top of the roof is home to a family of blue jays, which are currently circling overhead. The family looks hungry, and appears to be searching for food in the area. Be careful not to drop any food while on the roof!\n",
        "neighborhood":
            "From this high up, you can see all over the neighborhood. The park is to the East and you can see your friends getting everything set up for your picnic. Better hurry!\n",
        "table":
            "The table is full of different snacks and beverages brought by the guests at the picnic. There's room at the table for all of your inventory as well.\n",
    

        "blueberries.eat":
            "You pop a blueberry in your mouth and bite down. It's tasty and a little bit tart. Better not eat too many before the picnic starts!",
        "mushrooms.eat":
            "You take a bite of the mushroom. It's savory and delicious. Better not eat too many before the picnic starts!",
        "dog treats.eat":
            "You crunch into one of the Groovy Snacks. The amazing bacon flavor is almost too good to be true. Better not eat too many before the picnic starts!",
        "soap.eat":
            "You try and take a bite of the soap, but the citrusy scent is too strong.",
        "mouse.eat":
            "You try and eat the mouse, but it scurrys away from you. That's not very nice, trying to eat your neighbors!",
        "ants.eat":
            "You open your mouth and try to eat one of the ants. It wriggles in your mouth, and you spit it back out instinctively. That's not very nice, trying to eat your neighbors!",
        "raccoon.eat":
            "You try and eat the raccoon, but it scurrys away from you. That's not very nice, trying to eat your neighbors!",
        "birds.eat":
            "The birds are flying too high up in the air for you to catch them and eat them. Besides, it's not very nice to eat your neighbors!",
        "table.eat":
            "Wait for your friends before you start snacking! I'm sure they're hungry too.",
    

        "blueberries.read":
            "The carton says \"Johnson Family Orchards.\"",
        "dog treats.read":
            "The Groovy Snacks are chicken & bacon flavored. The back of the box lists a lot of ingredients that you can't pronounce.",
        "letter.read":
            "The letter reads \n\"Good morning Marni! I hope you had a great nap! The day is beautiful outside, and I've decided to throw a picnic! You are cordially invited to join us at Henderson Park this afternoon. Everybody is asked to bring three different snacks, a picnic blanket, and an umbrella. (If you're unable to find everything, that's OK too!)\nYour friend,\nJunimo the cat\n",
        "soap.read":
            "The letters \"SOAP\" are faintly visible on the white bar of soap.",
        "football helmet.read":
            "The logo for the Wildcats, the local high school football team, is printed on the side of the helmet.",
        "towel.read":
            "The tag on the towel reads: \"Wash in hot water. Hang dry after washing\"",
    
        "towel.nap":
            "You bundle the towel around you, and hunker down for a short little nap. The towel is covered in your fur when you wake up a little while later.",
        "sofa.nap":
            "You snuggle back into the familiar sofa, curled up near the armrest. The warm sunbeam is very relaxing, and you wake up refreshed and ready to prepare for the picnic.",
        "suitcase.nap":
            "It's cold in the basement, but you're able to undo the latches on the suitcase and hunker down where it is a little warmer. Not the best napping location, but it will suffice for a quick 10 minute nap.",
        "refrigerator.nap":
            "It's chilly in here, but that won't stop a determined animal from having a quick nap. You push aside some bottles of gatorade and have a quick refreshing snooze.",
        "shelves.nap":
            "It's way too crowded here for you to fit comfortably, unfortunately.",
        "blanket.nap":
            "This is your human's favorite blanket. Conveniently, it's also your favorite blanket. You curl up and nuzzle in, relaxing on the bed until you're ready to continue your quest.",
        "window.nap":
            "It's too precarious to try and nap on the window. Better find somewhere safer to nap.",
        "sink.nap":
            "It's too wet in the sink, due to the dripping faucet. Not ideal napping conditions, at all.",
        "bathtub.nap":
            "There's nothing in the bathtub to keep you warm, and your paws slip and slide on the smooth porcelain. You try and get some shut-eye, but it's just not working for you here.",
        
        "rocking chair.nap":
            "There's nothing quite like being curled up on a rocking chair, feeling the gentle sway as the birds chirp in the trees nearby. You wake up later on, refreshed and ready to continue.",
        "dirt pile.nap":
            "It's not very stylish, but there's something primal and enjoyable about a quick nap in a pile of dirt. Don't tell the humans, though, or they might start to look at you funny.",
        "table.nap":
            "Why are you napping here? All of your friends are nearby, go have fun with them!",
    
        "blueberries.scratch":
            "You scratch through the carton of blueberries, and now your paw is covered in blueberry juice. Yum! Messy!",
        "mushrooms.scratch":
            "Your paw scratches through the mushroom, cutting it into bite sized pieces. It'll be easier to snack on now!",
        "dog treats.scratch":
            "You scratch the Groovy Snacks, leaving a few crumbs at your feet. That didn't really help at all.",
        "towel.scratch":
            "You dig your paws in and scratch at the big towel. You can tell the humans wouldn't be thrilled if they caught you doing this, but that's what makes it so much fun!",
        "umbrella.stratch":
            "Be careful! If you scratch the umbrella, then it might rip!",
        "letter.scratch":
            "The letter is written on delicate paper. Better not scratch it.",
        "soap.scratch":
            "You scratch the bar of soap, leaving a few pieces at your feet. That didn't really help at all.",
        "sofa.scratch":
            "You know the humans wouldn't want you scratching up the sofa, right? Better not...",
        "mouse.scratch":
            "You try to scratch the mouse but it scampers away from you. Be careful, your claws are sharp!",
        "suitcase.scratch":
            "The worn leather scratches easily against your paws. This suitcase is super old, and already falling apart.",
        "ants.scratch":
            "You scratch at one of the ants, crushing it under your paw. That wasn't very nice!",
        "blanket.scratch":
            "You know the humans wouldn't be thrilled if they caught you scratching this blanket, but it's your favorite! They won't mind a few small scratches, right?",
        "dirt pile.scratch":
            "There's nothing quite as satisfying as digging and scratching around in a big pile of dirt. You could do this all day long, but you really should get back to your quest.",
        "raccoon.scratch":
            "You scratch at the raccoon and it growls back at you. You'd better not...",
        "table.scratch":
            "You take a paw and scratch your name into the wood of the table. You're such a renegade!",
    

        "flashlight.use":
            "You hold the flashlight with your mouth and turn it on with a loud CLICK. You wave it around, and now you can see better in dark spaces!",
        "football helmet.use":
            "You put the helmet on and strap it to your head. You feel unstoppable now! No closed doorway can stand in your way now.",
        "wooden spoon.use":
            "You prop the bin open, revealing the tasty Groovy Snacks inside. You load some of the delicious snacks up into your bag.",
        "soap.use":
            "You hand the bar of soap to the raccoon, and he eagerly begins washing himself off. Soon enough, the muddy coat of fur is shimmering and luxurious. The raccoon coiffes its hair back, gives you a wink, and hands you the umbrella!\n",
        "table.use":
            "You set up all of your snacks and party supplies on the table. Everyone will be so excited for what you brought!",

        "mouse.invite":
            "You let the mouse know about the picnic, and they let out a small squeak of delight. They're excited to be included, and will bring some of their aged cheese to snack on.",
        "ants.invite":
            "Normally, ants at a picnic is not a wanted thing. But you're being a kind neighnor, and inviting them anyway. The ants wiggle their antennae, which you interperet as accepting the invitation.",
        "raccoon.invite":
            "The grimy raccoon nods its head in agreement, and it appears excited to be included in the picnic festivities!",
        "birds.invite":
            "The birds let out a chorus of chirps, which sounds like they accept the invitation. The birds are always the life of the party; it's good that you invited them.",
    

        "mouse.talk":
            "The mouse looks up at you and remarks \"Wow, I haven't seen you down here in a while! I hear you and the humans stomping their feet all the time upstairs...do you think you could keep it down a little?\"",
        "ants.talk":
            "Ants are not great conversationalists,apparently. The ant in front of you starts describing how great the queen is, how wonderful a leader she is, how powerful her mandibles are...this ant could really use a hobby.\n",
        "raccoon.talk":
            "The raccoon has all of the hot gossip from the alley. You hear all of the details of the rivalry between the squirrels and the chipmunks on either side of the alley. You get all of the salacious details about the star-crossed-love of the owl in the nearby oak tree and the corgi that lives next door. Who knew that the alley could be such a hub for drama!\n",
        "birds.talk":
            "The birds start twittering over each other, trying to be the first to tell you about a shiny pebble they found yesterday.\n",
    
        "towel.wear":
            "You wrap the towel around your neck and use your teeth and paws to tie it into an awesome cape. You look like a superhero!\n",
        "umbrella.wear":
            "You pop the umbrella open and sling it over your shoulder. Sure it's a sunny day outside, but this makes you look very fashionable.\n",
        "football helmet.wear":
            "You put the helmet on and strap it to your head. You feel unstoppable now! No closed doorway can stand in your way now.\n",
        "blanket.wear":
            "This blanket is huge, but you somehow wrap yourself up in it. You look like a giant green blob.\n",
    

        "tv.listen":
            "You can hear the gentle tones of David Attenborough as he describes the hunting behaviors of lions. The soft voiceover is interrupted by a deep, frightening roar from the lion as it pounces on an innocent gazelle.\n",
        "mouse.listen":
            "The mouse squeeks quietly from behind a corner, trying to not draw much attention to itself.\n",
        "refrigerator.listen":
            "The refrigerator buzzes it's eternal buzzing sound. It's oddly comforting, in a way.\n",
        "window.listen":
            "You can hear the birds chirping, and the wind rustling through the trees outside. Cars rarely drive down this road, which means that the natural sounds remain undisturbed.\n",
        "sink.listen":
            "DRIP...DRIP...DRIP... The leaky faucet has been making this sound for weeks.\n",
        "raccoon.listen":
            "You can hear the raccoon chittering to itself. He sounds a bit grumpy, especially since he's covered in dirt and grime. Maybe he could use some soap to help clean up?\n",
        "neighborhood.listen":
            "The soft voices of your friends at the park can be heard from your vantage point. They seem to be setting up for the picnic and laughing together.\n"
    
        }]
    




}